[
  {
    "id": "LAFF_talents_dawncore_drive",
    "name": "Dawncore Drive",
    "icon": "NUCLEAR CAVALIER",
    "terse": "Improve your survivability by replacing your reactor with an Dawncore drive",
    "description": "Laffey testing desc",
    "ranks": [
      {
        "name": "Dawncore Tier 1",
        "description": "While flying, you get the following benefits:<ul><li>You make all Agility checks and saves with +1 Accuracy.</li><li>Any time an attack misses you, you may fly up to 2 spaces in any direction as a reaction.</li></ul>",
        "synergies": [
          {
            "locations": [
              "agility, active_effects"
            ],
            "detail": "Make all Agility checks and saves with +1 Accuracy."
          }
        ],
        "actions": [
          {
            "name": "Acrobatics",
            "activation": "Reaction",
            "trigger": "Any time an attack misses you.",
            "detail": "You may fly up to 2 spaces in any direction."
          }
        ]
      },
      {
        "name": "Dawncore Tier 2",
        "description": "When you Boost while flying, you may move an additional 1d6 spaces, but take heat equal to half that amount.",
        "synergies": [
          {
            "locations": [
              "boost"
            ],
            "detail": "When you Boost while flying, you may move an additional 1d6 spaces, but take heat equal to half that amount."
          }
        ]
      },
      {
        "name": "Dawncore Tier 3",
        "description": "As a quick action on your turn, you may <b>spin up your thrusters</b>. If you end your turn flying, you may nominate a character within a Range equal to your Speed and within line of sight, and gain the <b>Supersonic</b> Reaction.",
        "actions": [
          {
            "name": "Spin Up Thrusters",
            "activation": "Quick",
            "detail": "As a quick action on your turn, you may spin up your thrusters. If you end your turn flying, you may nominate a character within a Range equal to your Speed and within line of sight, and gain the Supersonic reaction."
          },
          {
            "name": "Supersonic",
            "activation": "Reaction",
            "frequency": "1/round",
            "init": "Requires activation of the <b>Spin Up Thrusters</b> quick action on your turn. If you end your turn flying, you may nominate a character within a Range equal to your Speed and within line of sight, you may use this reaction.",
            "trigger": "Your target’s turn ends.",
            "detail": "You fly to a space free and adjacent to them. There must be a path to do so but you can move even if the nominated character is no longer within your movement range or line of sight. This ignores engagement and does not provoke reactions."
          }
        ]
      }
    ]
  }
]