[
  {
    "id": "54f81590-7e41-4db9-8643-4f849d948ae9",
    "license_id": "54f81590-7e41-4db9-8643-4f849d948ae9",
    "source": "STC",
    "license_level": 2,
    "name": "Crusader",
    "mechtype": ["Striker", "Defender"],
    "description": "The Crusader, Steel Core's CQC Striker mech, wasn't born from Etsio’s hands but from his mind. Etsio directed its creation with a singular vision: a machine built for front-line domination, designed to survive the harshest of engagements and turn the tide in close-quarters combat. He was notorious for sitting down with STC’s top engineers, not to micromanage the technical details, but to lay down the essence of what the Crusader needed to be—a relentless, unstoppable force. “If it can’t take a hit, I don’t want it,” he famously declared. This led to the Crusader’s thick armor and the integration of the Shock Shield, ensuring it could shrug off the heaviest blows and explosive damage. Etsio envisioned the Crusader as a juggernaut in melee combat. He didn’t care for long-range artillery, so the engineers crafted the Pile Bunker, a tungsten spike launcher capable of punching through any armor and finishing foes with ruthless efficiency. The integration of the Blitz Core into the Crusader was Etsio’s crowning touch. He demanded a system that would let the Crusader charge across the battlefield, disregarding enemy reactions and tearing through defenses. The Blitz Core perfectly encapsulated his philosophy: never stop moving, never stop attacking. With the core active, the Crusader became a blur of destructive energy, knocking down enemies and delivering punishing hits with enhanced speed.",
    "mounts": [
      "Main",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 3,
      "hp": 10,
      "evasion": 7,
      "edef": 8,
      "heatcap": 5,
      "repcap": 7,
      "sensor_range": 8,
      "tech_attack": -2,
      "save": 10,
      "speed": 4,
      "sp": 6
    },
    "traits": [
      {
        "name": "Guardian",
        "use": "",
        "description": "<div>Adjacent allied characters can use the mech for hard cover.</div><div><br></div>"
      },
      {
        "name": "Shock Shield",
        "use": "",
        "description": "<div>The Mech has resistance explosive AOE damage.</div>"
      },
      {
        "name": "Trophy System",
        "use": "Round",
        "description": "<div>An integrated automatic AI system that targets incoming rounds, launching counterfire to intercept them to potentially take no damage.</div>",
        "actions": [
          {
            "name": "Activate Trophy System",
            "activation": "Reaction",
            "detail": "<div>The Trophy System attempts to intercept incoming attacks. 2/Round. <br><br>Requires an attack roll higher than the incoming attack to negate said attack.<br><br>Does not work against SMART weapons.</div>",
            "pilot": false,
            "synergy_locations": [
              "pilot_weapon"
            ],
            "tech_attack": false,
            "frequency": "2/round",
            "init": "",
            "trigger": "<div>Yourself or an ally within range 8 get attacked</div>"
          }
        ]
      }
    ],
    "core_system": {
      "name": "Blitz Core",
      "active_name": "Blitz Tactics",
      "active_effect": "<p>The Crusader moves spaces equal to double their Speed in a straight line, ignoring reactions and engagement. When charging all characters adjacent to the path follow or adjacent to their final position – hostile and allied – must succeed on a Hull save or be knocked Prone. You can use Pile Bunker once as a free action, ignoring the loading trait. IF the target dies from the pile bunker, you may select a new target as a reaction, letting you charge them.<br><br>All attacks made in this state, gives it Reliable 4.<br>While active gain 1d3 HEAT per turn.</p>",
      "activation": "Protocol",
      "description": "<p>The core goes into hyperdrive, increasing speed in all forms exponentially. Select a target (preferably someone in the backline), you charge into melee with said mech, pushing through any and all mechs of equal or smaller size. Max range equal to max speed.</p>",
      "deactivation": "Free",
      "use": "Scene",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "",
      "passive_effect": "",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [
        "8ae83645-bdac-4213-8e10-d675d444dab7",
        "401aa282-0dcd-45a3-b177-10c7bcf68cd9"
      ],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/nodata.png",
    "y_pos": 25
  },
  {
    "id": "LAFF_monitor",
    "license_id": "LAFF_monitor",
    "source": "STC",
    "license_level": 2,
    "name": "Monitor",
    "mechtype": ["Controler"],
    "description": "Developed as a pet project by 53R3N17Y, also known as Alva Sol, a notorious hacker with a reputation across the galaxy for her cyber-warfare prowess, the Monitor was designed to reflect her unique combat philosophy: control through superior information. The Monitor’s systems allow it to engage multiple enemies simultaneously, overwhelming their defenses with intrusive hacks and deep scans while feeding critical data to its allies.\n\nUnlike many combat mechs, the Monitor isn't meant to dominate through raw power but through its ability to predict, scan, and neutralize threats before they can act. Rumored to have been inspired by the advanced technology of Concord enforcement mechs in the outer reaches, the Monitor combines cutting-edge sensor arrays with powerful tech-driven assaults that can disable entire squadrons with little more than a few well-timed commands.\n\nAlva Sol, incorporated her personal system to amplify her invasive techniques. Her signature ability, the Obfuscation Manifold, overloads her sensor suite to such an extent that <br><span class='horus--subtle'>she can bend the very fabric of cyber space</span> becoming a ghost in the battlefield while orchestrating devastating digital strikes.\n\nMany have underestimated the Monitor's potential due to its small size and support role, only to find themselves overwhelmed by its near-limitless sensor range and the withering heat assaults generated by its hacking shards.",
    "mounts": ["Main"],
    "stats": {
      "size": 0.5, 
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 7,
      "evasion": 9,
      "edef": 9,
      "heatcap": 5,
      "repcap": 3,
      "sensor_range": 15,
      "tech_attack": 2,
      "save": 11,
      "speed": 5,
      "sp": 8
    },
    "traits": [
      {
        "name": "Fragile",
        "use": "",
        "description": "<div>Gain +1 difficulty on Hull and Engineering checks and saves.</div><div><br></div>"
      },
      {
        "name": "Scout Frame",
        "use": "",
        "description": "<div>Ignores difficult terrain and can not be discovered on sensors while hiding.</div><div><br></div>"
      },
      {
        "name": "Data Siphon",
        "use": "",
        "description": "<div>Whenever the Monitor makes a tech attack against a hostile character, it may also automatically Scan them.</div><div><br></div>"
      },
      {
        "name": "Full-Spectrum Sensor Suite",
        "use": "",
        "description": "<div>The Monitor may Lock On as a protocol. Whenever an allied character within Range 10 consumes any Lock On, their attack is not affected by cover.</div><div><br></div>"
      },
      {
        "name": "Intergrated Sensor Booster and Targeting System.",
        "use": "",
        "description": "The monitior has an intergraded Sensor Booster and Targeting System. You may not add more to the frame."
      }
    ],
    "core_system": {
      "name": "Dissolution Sequencer",
      "active_name": "Obfuscation Manifold",
      "active_effect": "Gain 5 Sensor range. Gain access to special tech options <br><span class='horus--subtle'>[unleashed shall i be and they will only know darkness henceforth]</span>",
      "activation": "Protocol",
      "description": "<p>All systems and sensor boosters overload increasing the mechs offensive tech abilities.</p>",
      "deactivation": "Free",
      "use": "Scene",
      "active_actions": [      
      {
        "name": "ENHANCE",
        "activation": "Quick Tech",
        "detail": "When you ENHANCE, you use your mech’s formidable processing power to enhance another character’s systems. To ENHANCE, choose a character within SENSORS. They receive +2 Accuracy on on all actions they make between now and the end of their next turn. Characters can only benefit from one ENHANCE at a time."
      },
      {
        "name": "Star Killer",
        "activation": "Full Tech",
        "detail": "Choose a target within sensors to start having a reactor meltdown. Unless they shutdown their mech they will blow up at the end of the next round.",
        "frequency": "2/scene"
      }],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "53R3N17Y's Personal System",
      "passive_effect": "Gain access to 53R3N17Y's custom hacking shards",
      "passive_actions": [
        {
          "name": "Intrusive Thoughts",
          "activation": "Full Tech",
          "detail": "The Monitor makes a tech attack against a character within Sensors. On a success, the target immediately as a reaction uses a weapon chosen by the Monitor to attack a character within Range. <br><span class='horus--subtle'>[It is a man's own mind not his enemy or foe that lures him to evil ways].</span>"
        }
      ],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": ["LAFF_sensor_booster", "LAFF_targeting_systems"],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/nodata.png",
    "y_pos": 25
  },
  {
    "id": "LAFF_mariana",
    "license_id": "LAFF_mariana",
    "source": "GMS",
    "license_level": 2,
    "name": "Mariana",
    "mechtype": ["Balanced"],
    "description": "Named after the Mariana Trench, the deepest point on Earth, the Mariana reflects GMS’s commitment to creating a frame capable of operating under immense pressure—both literal and metaphorical. This frame is designed for those who need more than just durability and firepower; it’s for Lancers who demand flexibility in the chaos of battle. Whether fighting in open space or in the depths of alien environments, the Mariana can handle it all. GMS saw the success of the Everest and decided to push the limits of what a standard frame could offer. The Mariana was designed to be the Everest MK II, incorporating years of field data, pilot feedback, and evolving battlefield needs. It's not just a frame for rookies learning the ropes—it’s built for seasoned veterans who need a platform that can be fine-tuned to their unique combat style. The inclusion of enhanced mod slots and more streamlined repair capabilities ensures that the Mariana can be refitted and rearmed with ease, making it ideal for extended campaigns where support might be limited.",
    "mounts": ["Flex", "Flex", "Heavy"],
    "stats": {
      "size": 2, 
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 12,
      "evasion": 8,
      "edef": 9,
      "heatcap": 7,
      "repcap": 6,
      "sensor_range": 12,
      "tech_attack": 0,
      "save": 10,
      "speed": 5,
      "sp": 6
    },
    "traits": [
      {
        "name": "Replaceable parts",
        "use": "",
        "description": "While resting, the Mariana can be repaired at a rate of 1 Repair per 1 structure damage, instead of 2 Repairs."
      },
      {
        "name": "Durable Boosters",
        "use": "",
        "description": "The Mariana has a propulsion system suitable for use in low or zero gravity and underwater environments. In those environments, you can fly and are not Slowed. You may also boost as a free action while not using the boosters as a EVA."
      },
      {
        "name": "In-Built Redundancy",
        "use": "",
        "description": "The Mariana has many in built systems and mounts that allow it for 1 structure damage ignore all effects."
      }
    ],
    "core_system": {
      "name": " 'Everest' COMP/CON",
      "active_name": "Protocol 1 & 2",
      "active_effect": "Choose one of the two protocol's",
      "activation": "Protocol",
      "description": "The mech has an inbuilt advanced comp/con unit to assist in piloting the mech and any other side actions to make the the job of the pilot easier. This AI does not count to your total AI count and can be replaced with an NHP to create a variant personal mech.",
      "deactivation": "",
      "use": "",
      "passive_name": "Protocol 3 - Protect the Pilot",
        "passive_effect": "When your mech is destroyed due to a failed structure save, the pilot automatically ejects and lands within range 8 (your choice of location). The mech then regains full HP and stays active for 2 rounds as an autonomous unit, prioritizing any immediate threats to the pilot. Once the 2 rounds are up the mech falls on the spot having completed it duty.",
      "passive_actions": [],
      "active_actions": [
        {
          "name": "Protocol 1 - Engage Defensive Maneuvers",
          "activation": "Protocol",
          "detail": "Activate the Everest's advanced evasion subroutines, granting your mech +2 Evasion and Resistance to all ranged attacks for the next 2 rounds."
        },
        {
          "name": "Protocol 2 - Offensive Override",
          "activation": "Protocol",
          "detail": "For the next 2 turns, gain an extra quick action and you can use Barrage as a Quick Action once during this period.",
          "frequency": "2/mission"
        }
      ],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": [{"id": "tg_ai"},{ "id": "tg_no_cascade"}]
    },
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/nodata.png",
    "y_pos": 25
  },
  {
    "id": "LAFF_Naga",
    "license_level": 2,
    "source": "HA",
    "name": "Naga",
    "mechtype": ["Artillery"],
    "y_pos": 32,
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/nodata.png",
    "variant": "Barbarossa",
    "description": "LORE",
    "mounts": ["Flex", "Heavy"],
    "stats": {
      "size": 3,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 10,
      "evasion": 6,
      "edef": 6,
      "heatcap": 10,
      "repcap": 4,
      "sensor_range": 8,
      "tech_attack": -2,
      "save": 10,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Heavy Frame",
        "description": "The Naga can’t be pushed, pulled, knocked Prone, or knocked back by smaller characters."
      },
      {
        "name": "Thermal Plating",
        "description": "The Naga has resistance to HEAT Damage."
      },
      {
        "name": "Colossus",
        "description": "Adjacent allied characters can use the Naga for hard cover.*"
      },
      {
        "name": "Slow",
        "description": "The Naga receives +1 difficulty on Agility checks and saves.",
        "synergies": [
          {
            "locations": ["agility", "skill_check"],
            "detail": "The Naga receives +1 difficulty on Agility checks and saves."
          }
        ]
      }
    ],
    "core_system": {
      "name": "Mortal Reminder",
      "description": "LORE",
      "active_name": "Set up to next stage/ Charge Railgun",
      "active_effect": "When activated you start setting up your railgun. any disruptions require you to make a 13+ D20 save otherwise you take the HEAT damage and have to start charge from 0",
      "activation": "Full Action",
      "integrated": ["LAFF_Naga_integrated"]
    }
  },
  {
    "id": "LAFF_Thalia",
    "license_level": 2,
    "source": "STC",
    "name": "Thalia",
    "mechtype": ["Support", "Striker"],
    "y_pos": 32,
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/nodata.png",
    "description": "LORE",
    "mounts": ["Aux/Aux", "Flex"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 8,
      "edef": 8,
      "heatcap": 4,
      "repcap": 4,
      "sensor_range": 8,
      "tech_attack": 0,
      "save": 10,
      "speed": 5,
      "sp": 10
    },
    "traits": [
      {
        "name": "Combat medic",
        "description": "Thalia and all allies adjacent to the Thalia gain +1 accuracy to HULL, SYSTEM and ENGINEERING saving throws."
      },
      {
        "name": "Assisted Repair",
        "description": "as a prepared action Thalia may give adjacent allies the quick action to repair to full HP. (The allie uses their own repair cap at their regular cost)"
      },
      {
        "name": "Intergrated IRDS and RAAR",
        "description": "You gain 2 intergrated Systems. RAAR Thalia Variant and IRDS Thalia Variant."
      }
    ],
    "core_system": {
      "name": "Cryptbloom",
      "description": "LORE",
      "active_name": "Superior Repair",
      "active_effect": "For the rest of the encounter the Thalia may use any repair actions twice as a quick action. Or you may choose as a full action to repair an ally's system or weapon using 1 RAAR charge. ",
      "activation": "Protocol",
      "integrated": ["LAFF_irds_thalia", "LAFF_raar_thalia"]
    }
  }
]