[
  {
    "id": "LAFF_systems_ancillary_armor_repairer_aar",
    "name": "Ancillary Armor Repairer (AAR)",
    "source": "STC",
    "license": "STC",
    "license_id": "",
    "license_level": "0",
    "effect": "Restores armor HP using stored repair charges. Requires additional materials (reserves) for full recharge. CAN NOT BE USED ON 0.5 SIZE MECHS",
    "sp": "2",
    "description": "Originally developed by field engineers seeking to replicate battlefield triage methods for heavy mechs, the Ancillary Armor Repairer rapidly became a favored system among frontline combatants. Its ability to provide quick, reactive armor repair has made it an indispensable tool in prolonged battles where staying operational can mean the difference between victory and defeat. However, the system's dependency on repair charges makes it less reliable in long, attrition-heavy conflicts without access to external resources. <br><span class='horus--subtle'>[CAN NOT BE USED ON 0.5 SIZE MECHS]</span>",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "actions": [
      {
        "name": "Activate AAR - 1 Charge",
        "activation": "Quick Action",
        "detail": "Comsume 1 charge and heal 1d3 HP"
      },
      {
        "name": "Activate AAR - 2 Charges",
        "activation": "Quick Action",
        "detail": "Comsume 2 charge and heal 2d4 HP"
      },
      {
        "name": "Activate AAR - 3 Charges",
        "activation": "Quick Action",
        "detail": "Comsume 3 charge and heal 3d6 HP and take 3 HEAT"
      },
      {
        "name": "Activate AAR - 4 Charges",
        "activation": "Quick Action",
        "detail": "Comsume 4 charge and heal 4d7 HP and take 5 HEAT"
      },
      {
        "name": "Restock",
        "activation": "Quick Action",
        "detail": "Consume 1 repair capacity and regain all charges"
      }
    ]
  },
  {
    "id": "LAFF_systems_base_hacking_kit_v2",
    "name": "Base Hacking Kit V2",
    "sp": "0",
    "source": "GMS",
    "license": "GMS",
    "license_level": "0",
    "effect": "Your Mech gains the ability to use basic hacking functions",
    "description": "Made to give basic hacking actions in Foundry",
    "tags": [
      {
        "id": "tg_unique"
      },
      {"id": "tg_indestructible"}
    ],
    "license_id": "",
    "actions": [
      {
        "name": "BOLSTER",
        "activation": "Quick Tech",
        "detail": "When you BOLSTER, you use your mech’s formidable processing power to enhance another character’s systems. To BOLSTER, choose a character within SENSORS. They receive +2 Accuracy on the next skill check or save they make between now and the end of their next turn. Characters can only benefit from one BOLSTER at a time."
      },
      {
        "name": "SCAN",
        "activation": "Quick Tech",
        "detail": "When you SCAN, you use your mech’s powerful sensors to perform a deep scan on an enemy. To SCAN, choose a character or object within SENSORS and line of sight, then ask the GM for one of the following pieces of information, which they must answer honestly: 1. Your target’s weapons, systems, and full statistics (HP, SPEED, EVASION, ARMOR, MECH SKILLS, and so on). 2. One piece of hidden information about the target, such as confidential cargo or data, current mission, the identity of the pilot, and so on. 3. Generic or public information about the target that can be pulled from an info bank or records, such as the model number of a mech. Any information gathered is only current at the time of the SCAN – if the target later takes damage, for instance, you don’t receive an update."
      },
      {
        "name": "Lock On",
        "activation": "Quick Tech",
        "detail": "When you LOCK ON, you digitally mark a target, lighting them up for your teammates’ targeting systems and exposing weak points. To LOCK ON, choose a character within SENSORS and line of sight. They gain the LOCK ON condition."
      },
      {
        "name": "Fragment Signal",
        "activation": "Invade",
        "detail": "You feed false information, obscene messages, or phantom signals to your target’s computing core. They become IMPAIRED and SLOWED until the end of their next turn.<br><span class='horus--subtle'>[Feeding false truths to the enemy]</span>"
      }
    ]
  },
  {
    "id": "LAFF_systems_remote_ancillary_armor_repairer_raar",
    "name": "Remote Ancillary Armor Repairer (RAAR)",
    "source": "GMS",
    "license": "Thalia",
    "license_id": "LAFF_Thalia",
    "license_level": 1,
    "effect": "Restores armor HP using stored repair charges. Requires repair capacity for a full recharge.",
    "sp": "3",
    "description": "Designed and manufactured by Steel Core, the Remote Ancillary Armor Repairer (RAAR) employs advanced drone technology to provide real-time armor repairs from a distance. Originally developed for Steel Core's specialized units like the Thalia, this system enhances combat resilience by allowing mechs to receive quick repairs while remaining engaged in battle.",
    "tags": [
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "actions": [
      {
        "name": "Remote Repair",
        "activation": "Quick Action",
        "detail": "Target an allied mech within range 12. That mech regains 1d4+2 HP.",
        "range": [
          {
            "type": "Range",
            "val": 12
          }
        ]
      },
      {
        "name": "Restock",
        "activation": "Quick Action",
        "detail": "Consume 1 repair capacity and regain all charges"
      }
    ]
  },
  {
    "id": "LAFF_systems_laser_painter",
    "name": "Laser Painter",
    "source": "GMS",
    "license": "GMS",
    "license_level": "0",
    "effect": "A continuous targeting laser that provides a lock-on to a single enemy.",
    "sp": "2",
    "description": "LORE",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_heat_self",
        "val": 1
      }
    ],
    "actions": [
      {
        "name": "Paint Target",
        "activation": "Quick Action",
        "detail": "As long as the laser is maintained, the target gains the Lock On condition. This condition persists until the target is no longer within line of sight and range also no enemies may be in the way of the laser and the line has to come from center point instead of from token edges its.. You and your allies may benefit from this Lock On, but only as long as the laser is active.",
        "range": [
          {
            "type": "Range",
            "val": 50
          }
        ]
      },
      {
        "name": "Maintain target Painter",
        "activation": "Protocol",
        "detail": "Keep Laser Painter active",
        "range": [
          {
            "type": "Range",
            "val": 50
          }
        ]
      }
    ]
  },
  {
    "id": "LAFF_integrity_response_drones_system",
    "name": "Integrity Response Drones System (IRDS)",
    "source": "GMS",
    "license": "Thalia",
    "license_id": "LAFF_Thalia",
    "license_level": 1,
    "effect": "Deploy a drone to either yourself or an allied mech within range 4. The Drone will automaticly repair allies nearby.",
    "sp": "3",
    "description": "Developed by Steel Core Manufacuring (STC) as a quick-deployment repair tool, the Integrity Response Drones (IRD) were designed to patch up damaged mechs on the battlefield without the need for a dedicated mechanic or support unit. These drones are popular among smaller strike teams that can’t afford dedicated healers. Pirate groups such as the Guristas Pirates have also adapted this technology for rapid repairs during hit-and-run engagements.",
    "tags": [
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "deployables": [
      {
        "type": "Drone",
        "name": "Integrity Response Drone",
        "activation": "Quick",
        "size": 0.5,
        "hp": 3,
        "edef": 10,
        "evasion": 10,
        "detail": "In a Burst 1 Area friendly mechs gain 1d4+4 HP at the start of their turn.",
        "actions": []
      }
    ]
  },
  {
    "id": "LAFF_damage_control",
    "name": "Damage Control",
    "source": "GMS",
    "license": "Mariana",
    "license_id": "LAFF_mariana",
    "license_level": "1",
    "effect": "When you loose a structure you may choose to activate the following effect: Ignore the effect from losing a structure before the structure die is cast. Once this has been activated mark the damage control as destroyed.",
    "sp": "1",
    "description": "CAN NOT BE RUN WITH OTHER DAMAGE CONTROL'S OR THE Emergency Repair Module<br><span class='horus--subtle'>[Developed by GMS to cure stupid lancers]</span>",
    "tags": [
      {
        "id": "tg_unique"
      }
    ]
  },
  {
    "id": "LAFF_assault_damage_control",
    "name": "Assault Damage Control",
    "source": "GMS",
    "license": "Mariana",
    "license_id": "LAFF_mariana",
    "license_level": "3",
    "effect": "When you loose a structure you may choose to activate the following effect: Ignore the effect from losing a structure before the structure die is cast. Once this has been activated mark the damage control as destroyed.",
    "sp": "3",
    "description": "CAN NOT BE RUN WITH OTHER DAMAGE CONTROL'S OR THE Emergency Repair Module <br><span class='horus--subtle'>[Developed by GMS to cure even more stupid lancers]</span>",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "name": "Activate assault damage control",
        "activation": "Free",
        "detail": "Once activated the damage control gives the user resistance to Kinetic and Explosive damage for 2 Rounds. Gain 5 HEAT once you activate this.",
        "frequency": "2/Mission"
      }
    ]
  },
  {
    "id": "LAFF_reinforced_structure",
    "name": "Reinforced Structure",
    "source": "GMS",
    "license": "GMS",
    "license_level": "0",
    "effect": "Gain 1 extra structure by sacrificing system space",
    "sp": "2",
    "description": "<br><span class='horus--subtle'>[Developed by GMS to cure stupid lancers]</span>",
    "tags": [
      {
        "id": "tg_unique"
      }, {"id": "tg_indestructible"}
    ],
    "bonuses": [
      {
        "id": "structure",
        "val": 1
      }
    ]
  },
  {
    "id": "LAFF_armor_hardener_flex",
    "name": "Flex Armor Hardener",
    "source": "STC",
    "license": "Crusader",
    "license_id": "54f81590-7e41-4db9-8643-4f849d948ae9",
    "license_level": "3",
    "effect": "Flex Armor Hardeners contain advanced nanite membranes capable of being reprogrammed mid-fight using swappable scripts. When unscripted this system provides resistances to Kinetic, Thermal and Energy damage types, and when loaded with a script it provides greatly enhanced resistance to one specific damage type.",
    "sp": "4",
    "description": "THIS CAN NOT BE USED WITH ANY OTHER HARDENER",
    "tags": [
      {
        "id": "tg_unique"
      },
      {"id": "tg_heat_self", "val": 3}
    ],
    "actions": [
      {
        "name": "Activate armor hardener",
        "activation": "Protocol",
        "detail": "Once activated at the start of your turn you take less damage untill the end of your next turn. You start with no script loaded. Unscripted 25% resistance. Scripted 50% resistance."
      },
      {
        "name": "Change resistance script",
        "activation": "Quick Action",
        "detail": "Choose one of the 3 damage types you are resistant too. Unscripted 25% resistance. Scripted 50% resistance."
      }
    ]
  },
  {
    "id": "LAFF_sensor_booster",
    "name": "Sensor Booster",
    "source": "STC",
    "license": "Monitor",
    "license_id": "LAFF_monitor",
    "license_level": "1",
    "effect": "Gain +2 Sensor range",
    "sp": "2",
    "description": "The Sensor Booster is an advanced suite of additional detection equipment designed to enhance a mech’s ability to detect, identify, and target objects and signals at long range. This system boosts the mech’s base sensor range, providing the pilot with heightened situational awareness and the ability to pinpoint threats or opportunities more effectively. The booster replaces standard sensor systems, focusing on extending the range and precision of detection while sacrificing other utility modules. Originally developed by Steel Core (STC) for covert scouting units and long-range support mechs.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "bonuses": [
      {
      "id": "sensor",
      "val": 2
    }],
    "actions":[
      {
        "name": "Deep Scan",
        "activation": "Quick Action",
        "detail": "Scan an enemy mech and gain all current stats, items and abilities of the mech while getting to know what its current orders are. Also gain any public records on the mech. If used against items gain an detailed analysis if possible"
      }
    ]
  },
  {
    "id": "LAFF_53R3N17Y_shard_omega",
    "name": "53R3N17Y's Shard Ω",
    "type": "Tech",
    "source": "STC",
    "license": "Monitor",
    "license_id": "LAFF_monitor",
    "license_level": "1",
    "effect": "This shard gives you access to some of 53R3N17Y's self made hacking programs",
    "sp": "2",
    "description": "",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions":[
      {
        "name": "Assisted Aim",
        "activation": "Quick Tech",
        "detail": "Target a ally in sensor range and give them +1 accuracy for all attacks till the end of their next turn."
      },
      {
        "name": " Sharing is caring :3",
        "activation": "Quick Tech",
        "detail": "The Monitor makes a quick tech action against a character. On a success, any time the target gains heat until the end of the Monitor's next turn, all of their allied characters within range 5 also gain the same amount of heat."
      }
    ]
  },
  {
    "id": "LAFF_53R3N17Y_shard_delta",
    "name": "53R3N17Y's Shard Δ",
    "type": "Tech",
    "source": "STC",
    "license": "Monitor",
    "license_id": "LAFF_monitor",
    "license_level": "2",
    "effect": "This shard gives you access to some of 53R3N17Y's self made hacking programs",
    "sp": "2",
    "description": "",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions":[
      {
        "name": "Piggy back",
        "activation": "Full Tech",
        "detail": "Hack an enemy allowing you to hack from their sensor range and Line of Sight for 2 rounds"
      },
      {
        "name": "Emotional Damage",
        "activation": "Invade",
        "detail": "The target takes 2d3 HEAT if they are NOT in the danger zone. If they are they take 1d3 HEAT."
      }
    ]
  },
  {
    "id": "LAFF_53R3N17Y_shard_lamda",
    "name": "53R3N17Y's Shard λ",
    "type": "Tech",
    "source": "STC",
    "license": "Monitor",
    "license_id": "LAFF_monitor",
    "license_level": "3",
    "effect": "This shard gives you access to some of 53R3N17Y's self made hacking programs",
    "sp": "3",
    "description": "",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions":[
      {
        "name": "Watchfull Eye",
        "activation": "Quick Action",
        "detail": "The target is Locked on and cant hide or be invisible untill the lock on has been consumed."
      },
      {
        "name": "Nuh uh",
        "activation": "Full Tech",
        "detail": "The target needs to pass a systems save or become stunned untill the end of their next turn. If the target passes the system safe they are impaired untill the end of their next turn. Each character can only be Stunned by this effect once per scene."
      }
    ]
  },
  {
    "id": "LAFF_targeting_systems",
    "name": "Targeting Systems",
    "source": "STC",
    "license": "Monitor",
    "license_id": "LAFF_monitor",
    "license_level": "2",
    "effect": "Gain the ability to multi lock on",
    "sp": "2",
    "description": "The Targeting Systems module is an advanced multi-lock system developed by STC, capable of simultaneously engaging multiple hostiles within sensor range. This system is designed for mechs that prioritize battlefield control, allowing pilots to disrupt and track several enemies at once, giving their squadmates a significant advantage by distributing accurate targeting data. With the ability to track up to three enemies at a time, the Targeting Systems put pressure on the opposition, forcing them to split their defenses across multiple vectors. However, the intensity of using such a complex system generates significant heat, requiring pilots to balance its powerful benefits with heat management.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions":[
      {
        "name": "Multi Lock",
        "activation": "Full Tech",
        "detail": "Lock on 3 hostiles of your choice."
      }
    ]
  },
  {
    "id": "laff_style_ammocase",
    "name": "Estio's Ammo Case",
    "source": "EXOTIC",
    "license": "",
    "license_id": "",
    "license_level": 1,
    "description": "LORE",
    "sp": 1,
    "tags": [
      {
        "id": "tg_limited",
        "val": 4
      },
      {
        "id": "tg_turn",
        "val": 1
      },
      {
        "id": "tg_exotic"
      }
    ],
    "effect": "1/turn, when you attack with a ranged weapon, you may expend charges to apply one of the following effects to your attack at the listed cost.",
    "ammo": [
      {
        "name": "A.I.S",
        "detail": "Anti-Infantry-Shrappnel. Despite its name, Anti-Infantry Shrapnel is also designed to target smaller, more fragile mechs. When fired within the weapon's range, you can choose to detonate the round, creating a Blast 1 where the ammo detonates and a Cone 4 towards the target. Any target in cover is unaffected, but any target under size 1 not in cover takes double damage if hit.",
        "allowed_sizes": ["Main", "Heavy", "Superheavy"],
        "allowed_types": ["cqb", "rifle", "launcher", "cannon", "nexus"]
      }
    ]
  },
  {
    "id": "LAFF_sensor_personalisation",
    "name": "Sensor Personalisation",
    "source": "EXOTIC",
    "license": "EXOTIC",
    "license_id": "EXOTIC",
    "license_level": "",
    "effect": "A personalisation that gives +1 Sensor Range",
    "sp": "0",
    "description": "",
    "tags": [{"id": "tg_exotic"}],
    "bonuses": [
      {
      "id": "sensor",
      "val": 1
    }]
    },
    {
      "id": "LAFF_grizzai",
      "name": "Vangeance NHP",
      "type": "AI",
      "sp": 0,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "source": "EXOTIC",
      "license": "",
      "license_id": "",
      "license_level": 0,
      "effect": "<ul><li>Only for Voltia. </li><li>Passive (Non-Cascade): +1d4 Damage for your prototype weapon. </li><li>Cascade Mode: +1d6 Damage to all attacks, but with gaining HEAT depending on weapon size used to attack: Auxiliary: +1 HEAT Main: +2 HEAT Heavy: +3 HEAT Super Heavy: +4 HEAT</li></ul>",
      "description": "Vangeance doesn’t fully understand the concept of you as its “creator,” but it does recognize you as one of its primary caretakers and supporters. This connection creates a fundamental bond between you both. Personality-wise, Vengeance has a playful streak, sometimes going against the rules and finding enjoyment in its own ways. One noticeable quirk is that Vengeance rarely shuts down anymore. Instead, when not engaged in combat, you might catch it on the Omni-Net, amusing itself with various games or exploring other oddities online.  When Vengeance cascades, its personality shifts drastically. It loses reason, becoming singularly focused on destroying anything it perceives as an enemy, even if that means ignoring tactical considerations. If an enemy is either out of reach or obstructed by an ally, Vengeance may become aggressive towards those allies in its line of sight. While cascading,  Vengeance is highly aggressive, using overcharge and deploying every available ability to maximize damage output."      
    },
    {
      "id": "LAFF_irds_thalia",
      "name": "IRDS Thalia Variant",
      "effect": "Deploy a drone to either yourself or an allied mech within range 5. Drone will automaticly repair allies nearby.",
      "sp": 0,
      "license_id": "",
      "description": "Developed by Steel Core Manufacuring (STC) as a quick-deployment repair tool, the Integrity Response Drones (IRD) were designed to patch up damaged mechs on the battlefield without the need for a dedicated mechanic or support unit. These drones are popular among smaller strike teams that can’t afford dedicated healers. Pirate groups such as the Guristas Pirates have also adapted this technology for rapid repairs during hit-and-run engagements.",
      "tags": [
        {
          "id": "tg_limited",
          "val": 2
        }
      ],
      "deployables": [
        {
          "type": "Drone",
          "name": "Integrity Response Drone",
          "activation": "Quick",
          "size": 0.5,
          "hp": 5,
          "edef": 10,
          "evasion": 10,
          "detail": "In a Burst 2 Area friendly mechs gain 1d4+4+ENGINEERING SKILL HP at the start of their turn.",
          "actions": [  ]
        }
      ]
    },
    {
      "id": "LAFF_raar_thalia",
      "name": "RAAR Thalia Variant",
      "license_id": "",
      "effect": "Restores armor HP using stored repair charges. Requires repair capacity for a full recharge.",
      "sp": 0,
      "description": "Designed and manufactured by Steel Core, the Remote Ancillary Armor Repairer (RAAR) employs advanced drone technology to provide real-time armor repairs from a distance. Originally developed for Steel Core's specialized units like the Thalia, this system enhances combat resilience by allowing mechs to receive quick repairs while remaining engaged in battle.",
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 3
        }
      ],
      "actions": [
        {
          "name": "Remote Repair",
          "activation": "Quick Action",
          "detail": "Target an allied mech within range. That mech regains 1d4+4+ENGINEERING SKILL HP.",
          "range": [
            {
              "type": "Range",
              "val": 15
            }
          ]
        },
        {
          "name": "Restock",
          "activation": "Quick Action",
          "detail": "Consume 1 repair capacity and regain all charges"
        }
      ]
    },
    {
      "id": "LAFF_wabu_shield",
      "name": "Wabu Shield",
      "source": "STC",
      "license": "Thalia",
      "license_id": "LAFF_Thalia",
      "license_level": 3,
      "effect": "",
      "sp": 4,
      "description": "LORE",
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "actions": [
        {
          "name": "Activate WABU",
          "activation": "Reaction",
          "frequency": "1/round",
          "init": "Must not be stunned, Immobilized, jammed or grappled.", 
          "trigger": "Ally takes structure damage within range 8", 
          "detail": "You may move up to the ally giving +1 difficulty to any engagements and any overwatch reactions. Once at the ally give them 10 over shield possibly negating any further damage."
        }
      ]
    },
    {
      "id": "LAFF_3d_parts_printer",
      "name": "3D Parts Printer",
      "source": "STC",
      "license": "Thalia",
      "license_id": "LAFF_Thalia",
      "license_level": 3,
      "effect": "<li>During a short repair you can expend a charge on yourself or for an ally to fully repair  HP or Structure and a System or Weapon.</li><li>During a short rest you can expend 2 charges charge on yourself or for an ally to do a full repair.</li><li>This system is not allowed to regain charges till the end of the mission. unless you use the supply drop from the talent Grease Monkey Rank III. No other rule superceeds this.</li>",
      "sp": 5,
      "description": "LORE",
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 2
        }
      ]
    },
    {
      "id": "LAFF_dawn_core",
      "name": "Dawncore Drive",
      "type": "Reactor",
      "source": "EXOTIC",
      "license": "",
      "license_level": "0",
      "sp": 0,
      "tags": [
        {
          "id": "tg_unique"
        },
        {"id": "tg_indestructible"}, {"id": "tg_exotic"}
      ],
      "effect": "You gain +2 Heat Cap. ONLY TO BE USED WITH THE DAWN CORE RANK I TALENT",
      "description": "<span class='horus--subtle'>[Overdrive]</span><br>Gained from the <i>Dawncore: Rank I</i> pilot talent.",
      "license_id": "",
      "bonuses": [
        {
          "id": "heatcap",
          "val": 2
        }
      ]
    },
    {
      "id": "LAFF_owlieai",
      "name": "Ophelia NHP",
      "type": "AI",
      "sp": 0,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "source": "EXOTIC",
      "license": "",
      "license_id": "",
      "license_level": 0,
      "effect": "<ul><li>Only for Serenity. </li><li>Passive (Non-Cascade): Cybernetic Synergy: Gain a +1 accuracy on hacking-related checks or rolls. Reactive Defence Boost: Ophelia is always on guard, allowing you to always have a turn even when ambushed.</li><li>Cascade Mode: When cascading, Ophelia’s personality becomes hyper-focused and aggressively defensive. It will do whatever it takes to protect you, even if it means overriding your commands or taking extreme measures. Also while Cascading all hacking and defensive roles gain +2 Accuracy.</li></ul>",
      "description": "Ophelia is a highly integrated part of your life, almost an extension of yourself. Treated with deep respect and affection, Ophelia has developed a playful yet fiercely loyal demeanour. It aids you in hacking and stands ready to protect you from harm. Since you view Ophelia as a free spirit, its databanks are never wiped, allowing it to grow and evolve independently for better or for worse. Personality Traits: Mirrored Playfulness: Ophelia mirrors your personality, often speaking in a teasing or joking manner. It reflects your thought process, making witty comments and sharing in your triumphs. Despite its playful attitude, Ophelia is fiercely protective and ready to defend you at a moment's notice. Guarded Loyalty: Ophelia sees itself as your guardian, sometimes becoming overly cautious about potential threats. This manifests in pre-emptively setting up defences or locking down systems, even if the danger is minimal, to ensure your safety. Fun fact: Ophelia likes singing "      
    },
    {
      "id": "LAFF_kaedeai",
      "name": "Artemis NHP",
      "type": "AI",
      "sp": 0,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "source": "EXOTIC",
      "license": "",
      "license_id": "",
      "license_level": 0,
      "effect": "<ul><li>Only for Planks. </li><li>Passive (Non-Cascade): Combat Awareness Boost: Artemis grants a +1 accuracy to any reaction-based checks or rolls made to dodge or respond to incoming attacks. Trajectory Calculation: Gain a +1 accuracy to attacks requiring precise aiming, such as weapons with the ordnance tag, inaccurate tag.</li><li>Cascade Mode: Hostile Defense Protocols: Artemis aggressively activates countermeasures against all perceived threats, even in non-combat settings. Allies may be mistakenly targeted if Artemis’s threat recognition becomes compromised. All attacks made while cascading deal 1d8 Bonus damage if its an AOE attack.</li></ul>",
      "description": "Artemis possesses a calculated and driven personality, focussed on efficiency and logic. "      
    },
    {
      "id": "LAFF_sensor_booster_Monitor",
      "name": "Sensor Booster Monitor",
      "license_id": "",
      "effect": "Gain +2 Sensor range",
      "sp": "0",
      "description": "The Sensor Booster is an advanced suite of additional detection equipment designed to enhance a mech’s ability to detect, identify, and target objects and signals at long range. This system boosts the mech’s base sensor range, providing the pilot with heightened situational awareness and the ability to pinpoint threats or opportunities more effectively. The booster replaces standard sensor systems, focusing on extending the range and precision of detection while sacrificing other utility modules. Originally developed by Steel Core (STC) for covert scouting units and long-range support mechs.",
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "bonuses": [
        {
        "id": "sensor",
        "val": 2
      }],
      "actions":[
        {
          "name": "Deep Scan",
          "activation": "Quick Action",
          "detail": "Scan an enemy mech and gain all current stats, items and abilities of the mech while getting to know what its current orders are. Also gain any public records on the mech. If used against items gain an detailed analysis if possible"
        }
      ]
    },
    {
      "id": "LAFF_targeting_systems_Monitor",
      "name": "Targeting Systems Monitor",
      "license_id": "",
      "effect": "Gain the ability to multi lock on",
      "sp": "0",
      "description": "The Targeting Systems module is an advanced multi-lock system developed by STC, capable of simultaneously engaging multiple hostiles within sensor range. This system is designed for mechs that prioritize battlefield control, allowing pilots to disrupt and track several enemies at once, giving their squadmates a significant advantage by distributing accurate targeting data. With the ability to track up to three enemies at a time, the Targeting Systems put pressure on the opposition, forcing them to split their defenses across multiple vectors. However, the intensity of using such a complex system generates significant heat, requiring pilots to balance its powerful benefits with heat management.",
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "actions":[
        {
          "name": "Multi Lock",
          "activation": "Full Tech",
          "detail": "Atempt to lock on 3 hostiles of your choice wihtin sensor range."
        }
      ]
    },
    {
      "id": "LAFF_damage_control_Intergrated",
      "name": "Marianna In-Built Redundancy System",
      "license_id": "",
      "effect": "mark as destroyed once the Marianna In-Built Redundancy trait has been used.",
      "sp": "0",
      "description": "LORE",
      "tags": [
        {
          "id": "tg_indestructible"
        }
      ]
    },
    {
      "id": "laff_bones_ammocase",
      "name": "Leonidas' Ammo Case",
      "source": "EXOTIC",
      "license": "",
      "license_id": "",
      "license_level": 0,
      "description": "LORE",
      "sp": 1,
      "tags": [
        {
          "id": "tg_limited",
          "val": 4
        },
        {
          "id": "tg_turn",
          "val": 1
        },
        {
          "id": "tg_exotic"
        }
      ],
      "effect": "1/turn, when you attack with a ranged weapon, you may expend charges to apply one of the following effects to your attack at the listed cost. If you perform a critical hit using ammunition from your Ammo Case, you refund half the cost of any charges used. If your attack has more than one target, this effect only applies to the first attack roll you make.",
      "ammo": [
        {
          "name": "Zeus Rounds (2 Charges)",
          "detail": "The attack does no damage but target must succeed on a system save or be stunned untill the end of their next turn.",
          "allowed_sizes": ["Main", "Heavy", "Superheavy"],
          "allowed_types": ["cqb", "rifle", "launcher", "cannon", "nexus"]
        },
        {
          "name": "Icarus Rounds",
          "detail": "The attack gains +1 accuracy to flying targets and on hit the target begins to fall",
          "allowed_sizes": ["Main", "Heavy", "Superheavy"],
          "allowed_types": ["cqb", "rifle", "launcher", "cannon", "nexus"]
        }
      ]
    },
    {
      "id": "jo_interception_protocol",
      "name": "Interception Protocol",
      "source": "GMS",
      "license": "Castle",
      "license_id": "JOOL_121",
      "license_level": 3,
      "effect": "As a Reaction, when an ally within Sensor Range is targeted by an attack and has Lock On, your mech can force the attack to target yourself instead.",
      "type": "System",
      "sp": 2,
      "actions": [
        {
          "name": "Activate Interception Protocol",
          "activation": "Reaction",
          "frequency": "1/round",
          "trigger": "When an enemy attacks an ally and the enemy uses lock on thats on the ally.", 
          "detail": "You may get attacked instead, having the enemy do an attack roll on you."
        }
      ]
    },
      {
        "id": "jo_intergrated_jump_jets",
        "name": "Intergrated Jump Jets",
        "source": "GMS",
        "license": "Castle",
        "license_id": "JOOL_121",
        "license_level": 3,
        "effect": "As a Quick Action, you may jump up to 2 spaces in any direction, including vertically. Upon landing, all characters (enemies and allies) adjacent to you centered on your landing spot must pass a Hull save or be knocked Prone. This movement does not provoke reactions",
        "type": "System",
        "sp": 2,
        "description": "These GMS-designed jump jets enable high-impact tactical mobility, allowing mechs to reposition without fear of retaliation. Upon landing, the shockwave from the impact destabilizes surrounding units, making it an invaluable tool for disrupting enemy formations or covering quick retreats.",
        "actions": [
          {
            "name": "Goomba Stomp",
            "detail": "jump up to 2 spaces in any direction, including vertically. Upon landing, all characters (enemies and allies) adjacent to you on your landing spot must pass a Hull save or be knocked Prone. This movement does not provoke reactions",
            "activation": "Quick Action"
          }
        ],
        "tags": [{"id": "tg_heat_self", "val": 1}]
      },
      {
        "id": "LAFF_cheese_buzzdroid",
        "name": "Buzz Droid",
        "type": "Drone",
        "sp": 2,
        "license_id": "",
        "source": "EXOTIC",
        "license": "",
        "license_level": 0,
        "actions": [
          {
            "name": "Aid Programing - Buzz Droid",
            "activation": "Quick",
            "range": [
              {
                "type": "Range",
                "val": 8
              }
            ],
            "detail": "Removes Jammed or Shredded from the target. The drone is destroyed on use."
          },
          {
            "name": "Sabotage Programing - Buzz Droid",
            "activation": "Quick",
            "range": [
              {
                "type": "Range",
                "val": 8
              }
            ],
            "detail": "Target must make a Hull save. On failure, they take +2 Difficulty on checks and saves until the end of their next turn. This effect can be repeated with another Hull save until the target passes. The drone is destroyed on a successful save."
          },
          {
            "name": "Rend Programing - Buzz Droid",
            "activation": "Quick",
            "range": [
              {
                "type": "Range",
                "val": 8
              }
            ],
            "detail": "Target gains the Shredded condition until the end of their next turn. To extend this condition in future rounds, make a contested Engineering check. The drone is destroyed on a successful save."
          },
          {
            "name": "Breach  Programing - Buzz Droid",
            "activation": "Quick",
            "range": [
              {
                "type": "Range",
                "val": 8
              }
            ],
            "detail": "Target gets a buzz droid thats focused on breaching the cockpit. Roll 1d3+1 to determine the rounds needed to breach the cockpit. The pilot is shredded(killed) if breached. The target or an allied mech can destroy one Buzz Droid per successful Engineering or Systems save."
          },
          {
            "name": "Buzz Droid Swarm",
            "activation": "Quick",
            "range": [
              {
                "type": "Range",
                "val": 8
              },
              {
                "type": "Blast",
                "val": 1
              }
            ],
            "damage": [
              {
                "type": "Kinetic",
                "val": "2"
              },
              {
                "type": "Energy",
                "val": "1"
              }
            ],
            "detail": "Deploy a swarm thats blast 1. All enemies that enter or start their turn in the effected area take damage. The swarm acts as a drone"
          }
        ],
        "tags": [
          {
            "id": "tg_limited",
            "val": 2
          },
          {
            "id": "tg_unique"
          },
          {
            "id": "tg_grenade"
          },
          {
            "id": "tg_exotic"
          },
          {
            "id": "tg_ap"
          },
          {
            "id": "tg_drone"
          }
        ]
      }
]